'' ============================================
'' ==========      通讯配置部分       ==========
'' ============================================

''======================== TO DO EtherNet通讯========================''

''======================== TO DO EtherCAT通讯========================''
DELAY(3000)  '等待驱动器设备上电完成
PRINT "总线通讯周期：",SERVO_PERIOD,"us"

GLOBAL CONST BUS_NODE_NUM = 5  ' 期望连接的设备数
GLOBAL CONST BUS_SLOT = 0  ' 槽位号，默认0
GLOBAL bus_initsate ' 总线初始化状态
GLOBAL bus_total_axis_num

bus_initsate = -1


Ecat_Init()

WHILE (bus_initsate = 0)
    Ecat_Init()
WEND



'' ============================================
'' ==========     配置/初始化部分     ==========
'' ============================================
'' 设置电机参数
dim u_j1      '关节1实际1mm脉冲数
dim u_j2      '关节2实际1mm脉冲数
dim u_j3      '关节3实际1mm脉冲数
dim u_j4      '关节4实际1mm脉冲数 
dim u_j5      '关节5实际1mm脉冲数 

CONST PB = 5  ' mm，丝杠导程
CONST ENCODER_PER_ROE = 8388607  ' 2^23-1

' UNITS为指定运行一个单位需要的脉冲数，之后所有的运动指令都以此为单位
' 总线也要设置UNITS，见手册ATYPE

''======================== TO DO 考虑用常量的方式实现宏定义的功能，例如轴编号========================''

''======================== TO DO 定义几何尺寸的变量========================''
dim a1  '' 实际上应该是向量
dim a2
dim PulesVROneCircle   '虚拟姿态轴一圈脉冲数

DEFINE_CFRAME  1001,5,1,0,1000    'framenum, totalaxises, axises_aux?,  max_attitudes,  rotatetype?

''======================== TO DO 对几何尺寸变量进行赋值========================''
a1 = 0  '' 实际上应该是向量
PulesVROneCircle=360*1000


''======================== TO DO 赋值========================''
u_j1 = 1000



'' 设置关节轴
BASE(0,1,2,3,4)
' ATYPE在总线初始化时就设置
UNITS = u_j1/360,u_j2/360,u_j3/360,u_j4/360  ' 把units设成每°脉冲数

DPOS=0,0,0,0,0  '设置关节轴的位置，此处要根据实际情况来修改。=======要结合回零位=========

'' 运动参数设置
speed=100,100,100,100,100
accel=1000,1000,1000,1000,1000
decel=1000,1000,1000,1000,1000


'' 虚拟轴设置
BASE(6,7,8,9,10,11)
atype = 0,0,0,0,0  ' 取0设置为虚拟轴
''======================== TO DO 配合C文件写入参数========================''
dim data_start
data_start = 0
TABLE(data_start,L1,L2,L3,L4,u_j1,u_j2,u_j3,u_j4,PulesVROneCircle)  ' 将参数写入到TABLE中，这样C配置文件中会读取对应的参数，第一个参数是指数据的起始位置

speed = 100,100,100,100,100,100
UNITS=1000,1000,1000,1000,1000,1000         '运动精度，要提前设置，中途不能变化

'' 插补设置
MERGE = ON
''======================== TO DO 插补的其他设置（或许用不到）========================''
' CORNER_MODE = 2
' DECEL_ANGLE = 15 * (PI / 180)
' STOP_ANGLE = 45 * (PI / 180)



'' 逆解模式
BASE(0,1,2,3,4)
CONNFRAME(1001,data_start,6,7,8,9,10,11)
WAIT LOADED  '' 等待加载完成


'' ============================================
'' ==========        运动部分        ==========
'' ============================================
'' 逆解状态下，只要move虚拟轴就可以了？


BAES(6,7,8,9,10,11)  ' 控制虚拟轴
''======================== TO DO 接收上位机发来的数据，并使用MOVE等运动指令========================''


''======================== TO DO 回零位========================''

''======================== TO DO 驱动器模式设置========================''
' DRIVE_TORQUE 获取驱动器力矩